test/fixtures/control/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      http://www.tridiagonal.co.in          |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(

);

regions
(    
	boxToCell 
	{
		box (-0.025 0.05 0.05) (0.265 0.395 0.295);

		fieldValues
		(
			volScalarFieldValue alpha1  1.0
		); 
	}    
);

// ************************************************************************* //
